LeeJunYong-12/STM32_PG_APPLICATION/02_Library/00_User/HSP/HSP_MicroSD.h
#ifndef	_HSP_MICROSD_H
#define	_HSP_MICROSD_H

#if 1 // yeom_20210120 [start]

#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>
#include	<stdarg.h>
#include	<math.h>

#include	"stm32f7xx_hal.h"

#include	"HSP.h"

#define	BSP_SD_DMA_USE					1

#define BSP_SD_CardInfo HAL_SD_CardInfoTypeDef

#define	MSD_OK							((uint8_t)0x00)
#define	MSD_ERROR						((uint8_t)0x01)
#define	MSD_ERROR_SD_NOT_PRESENT		((uint8_t)0x02)
	 
#define	SD_TRANSFER_OK					((uint8_t)0x00)
#define	SD_TRANSFER_BUSY				((uint8_t)0x01)

#define	SD_PRESENT						((uint8_t)0x01)
#define	SD_NOT_PRESENT					((uint8_t)0x00)

#define SD_CARD1						((uint32_t)0x00)
#define SD_CARD2						((uint32_t)0x01)
		
#define SD_DATATIMEOUT					((uint32_t)100000000)

#define __DMAx_TxRx_CLK_ENABLE			__HAL_RCC_DMA2_CLK_ENABLE
#define SD1_DMAx_Tx_CHANNEL				DMA_CHANNEL_4
#define SD1_DMAx_Rx_CHANNEL				DMA_CHANNEL_4
#define SD1_DMAx_Tx_STREAM				DMA2_Stream6
#define SD1_DMAx_Rx_STREAM				DMA2_Stream3
#define SD1_DMAx_Tx_IRQn				DMA2_Stream6_IRQn
#define SD1_DMAx_Rx_IRQn				DMA2_Stream3_IRQn
#define BSP_SDMMC1_DMA_Tx_IRQHandler	DMA2_Stream6_IRQHandler
#define BSP_SDMMC1_DMA_Rx_IRQHandler	DMA2_Stream3_IRQHandler
#define BSP_SDMMC1_IRQHandler			SDMMC1_IRQHandler
	
#define SD2_DMAx_Tx_CHANNEL				DMA_CHANNEL_11
#define SD2_DMAx_Rx_CHANNEL				DMA_CHANNEL_11
#define SD2_DMAx_Tx_STREAM				DMA2_Stream5
#define SD2_DMAx_Rx_STREAM				DMA2_Stream0
#define SD2_DMAx_Tx_IRQn				DMA2_Stream5_IRQn
#define SD2_DMAx_Rx_IRQn				DMA2_Stream0_IRQn
#define BSP_SDMMC2_DMA_Tx_IRQHandler	DMA2_Stream5_IRQHandler
#define BSP_SDMMC2_DMA_Rx_IRQHandler	DMA2_Stream0_IRQHandler
#define BSP_SDMMC2_IRQHandler			SDMMC2_IRQHandler
	
#define SD_DetectIRQHandler()			HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_8)

extern	SD_HandleTypeDef				hMicroSD1, hMicroSD2;

u8 MSD_GpioInit();
u8 MSD_Detect();
uint8_t	BSP_SD_Init(void);
uint8_t	BSP_SD_InitEx(uint32_t SdCard);
uint8_t	BSP_SD_DeInit(void);
uint8_t	BSP_SD_DeInitEx(uint32_t SdCard);
uint8_t	BSP_SD_ITConfig(void);
uint8_t	BSP_SD_ITConfigEx(uint32_t SdCard);
uint8_t	BSP_SD_ReadBlocks(uint32_t *pData, uint32_t ReadAddr, uint32_t NumOfBlocks, uint32_t Timeout);
uint8_t	BSP_SD_ReadBlocksEx(uint32_t SdCard, uint32_t *pData, uint32_t ReadAddr, uint32_t NumOfBlocks, uint32_t Timeout);
uint8_t	BSP_SD_WriteBlocks(uint32_t *pData, uint32_t WriteAddr, uint32_t NumOfBlocks,  uint32_t Timeout);
uint8_t	BSP_SD_WriteBlocksEx(uint32_t SdCard, uint32_t *pData, uint32_t WriteAddr, uint32_t NumOfBlocks,  uint32_t Timeout);
uint8_t	BSP_SD_ReadBlocks_DMA(uint32_t *pData, uint32_t ReadAddr, uint32_t NumOfBlocks);
uint8_t	BSP_SD_ReadBlocks_DMAEx(uint32_t SdCard, uint32_t *pData, uint32_t ReadAddr, uint32_t NumOfBlocks);
uint8_t	BSP_SD_WriteBlocks_DMA(uint32_t *pData, uint32_t WriteAddr, uint32_t NumOfBlocks);
uint8_t	BSP_SD_WriteBlocks_DMAEx(uint32_t SdCard, uint32_t *pData, uint32_t WriteAddr, uint32_t NumOfBlocks);
uint8_t	BSP_SD_Erase(uint32_t StartAddr, uint32_t EndAddr);
uint8_t	BSP_SD_EraseEx(uint32_t SdCard, uint32_t StartAddr, uint32_t EndAddr);
uint8_t	BSP_SD_GetCardState(void);
uint8_t	BSP_SD_GetCardStateEx(uint32_t SdCard);
void	BSP_SD_GetCardInfo(BSP_SD_CardInfo *CardInfo);
void	BSP_SD_GetCardInfoEx(uint32_t SdCard, BSP_SD_CardInfo *CardInfo);
uint8_t BSP_SD_Detect(SD_HandleTypeDef *pHandle);
uint8_t	BSP_SD_DetectChk(uint8_t data);


void	BSP_SD_MspInit(SD_HandleTypeDef *hsd, void *Params);
void	BSP_SD_MspDeInit(SD_HandleTypeDef *hsd, void *Params);
//void	BSP_SD_AbortCallback(uint32_t SdCard);
//void	BSP_SD_WriteCpltCallback(uint32_t SdCard);
//void	BSP_SD_ReadCpltCallback(uint32_t SdCard);
void	BSP_SD_AbortCallback(SD_HandleTypeDef *hsd);
void	BSP_SD_WriteCpltCallback(SD_HandleTypeDef *hsd);
void	BSP_SD_ReadCpltCallback(SD_HandleTypeDef *hsd);
#else
#include	"HSP.h"

u8 MSD_GpioInit();
u8 MSD_Detect();
u8 MSD_Init();
u8 MSD_DeInit();
u8 MSD_GetCardState();
u32 MSD_GetSectorCount();
u32 MSD_GetSectorSize();
u32 MSD_GetBlockSize();
u8 MSD_ReadBlock(u32 blockAdrs, u8 *pData, u32 size);
u8 MSD_WriteBlock(u32 blockAdrs, u8 *pData, u32 size);
#endif // yeom_20210120 [end]

#endif	//	_HSP_MICROSD_H
